---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorAssembly
source: html/3ad4f99d-77b2-51b9-8b94-376e4594fbb3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorAssembly Property

"Assembly"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemAnchorAssembly { get; }
```